app/controllers/games_controller.rb

  def show
    if params[:id]
      game = Game.find params[:id]
	  order = game.players.map(&:order)
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 0]]
SELECT "players".* FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 16]]

  def start
    if params[:game_id]
      game = Game.in_room.find params[:game_id]
---
SELECT  "games".* FROM "games"  WHERE "games"."in_room" = 't' AND "games"."id" = ? LIMIT 1  [["id", 16]]

  def close
    if params[:game_id]
      game = Game.find params[:game_id]
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 16]]

  def get_shots
    if params[:game_id]
      game = Game.actives.find params[:game_id]
      shots = game.shots.where("index_in_game > ?", params[:shot_id]).order(:index_in_game)
---
SELECT  "games".* FROM "games"  WHERE "games"."active" = 't' AND "games"."id" = ? LIMIT 1  [["id", 91]]
SELECT "shots".* FROM "shots"  WHERE "shots"."game_id" = ? AND (index_in_game > '8')  ORDER BY "shots"."index_in_game" ASC  [["game_id", 91]]

  def add_shot
    game = Game.actives.find params[:game_id]
    index = Integer(params[:shot_id])
    shots_count = game.shots.count
    if (index == shots_count + 1)
      shot = nil
      params[:shots].each_with_index do |param_shot, ind|
        shot = Shot.create(:game => game, :index_in_game => index, :content => params["shots"][ind.to_s]["content"])
---
SELECT  "games".* FROM "games"  WHERE "games"."active" = 't' AND "games"."id" = ? LIMIT 1  [["id", 91]]
SELECT COUNT(*) FROM "shots"  WHERE "shots"."game_id" = ?  [["game_id", 91]]
INSERT INTO "shots" ("content", "created_at", "game_id", "index_in_game", "updated_at") VALUES (?, ?, ?, ?, ?)