app/controllers/rooms_controller.rb

INSERT INTO "games" ("created_at", "in_room", "infos", "n_goals", "n_territories", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-13 23:07:11.082491"], ["in_room", "t"], ["infos", "0.1b"], ["n_goals", 16], ["n_territories", 42], ["name", "aaaa"], ["updated_at", "2014-11-13 23:07:11.082491"]]
---
  def create
    params.permit!
    game = Game.new(params[:game])
    game.in_room = true
    game.save

SELECT  "games".* FROM "games"  WHERE "games"."in_room" = 't' AND "games"."id" = ? LIMIT 1  [["id", 85]]
SELECT COUNT(*) FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 85]]
INSERT INTO "players" ("color", "created_at", "game_id", "name", "type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["color", 0], ["created_at", "2014-11-13 23:07:11.494515"], ["game_id", 85], ["name", "aaaa"], ["type_id", 0], ["updated_at", "2014-11-13 23:07:11.494515"]]
---
  def connect
    game = Game.in_room.find(params[:game_id])
    if game.present? && game.players.count < 6
      params.permit!
      p = Player.new(params[:player])
      p.game = game
      p.color = game.raffle_color
      p.save

SELECT  "players".* FROM "players"  WHERE "players"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 80]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 217]]
SELECT COUNT(*) FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 88]]
---
  def disconnect
    params[:players].each_with_index do |player_id,index|
		player = Player.find (params["players"][index.to_s].to_i)
		game = player.game
		player.game = nil
		player.destroy
		game.reload
		if game.players.count ==0