app/controllers/rooms_controller.rb

  def disconnect
    player = Player.find params[:player]
    player.game = nil
    player.save
---
UPDATE "players" SET "game_id" = ?, "updated_at" = ? WHERE "players"."id" = 257  [["game_id", nil], ["updated_at", "2014-11-13 23:24:20.314611"]]